Sintaxe comum de um SELECT: `SELECT coluna1, coluna2, coluna3 FROM tabela;`

Pacotes

In [13]:
import sqlite3
import pandas as pd

Criando uma conexão com o banco de dados

In [14]:
con = sqlite3.connect('companhiaMB') 
cur = con.cursor() # salva comandos na memória
print('Conectado ao banco!')

Conectado ao banco!

Consultando todos os dados da tabela

In [15]:
query = 'SELECT * FROM funcionarios'

df = pd.read_sql_query(query, con)
df

  PrimeiroNome UltimoNome  USERID
0      Matheus     Brasil    1997
1      Vitória      Lopes    1998
2      Eduardo      Silva    2001

Consultando colunas específicas

In [16]:
query = 'SELECT USERID, PrimeiroNome FROM funcionarios'

df = pd.read_sql_query(query, con)
df

   USERID PrimeiroNome
0    1997      Matheus
1    1998      Vitória
2    2001      Eduardo

Cálculos com SELECT

In [18]:
#primeiro, vou inserir uma nova coluna com salário e aluguel para cada um dos funcionários

con.executescript(
    '''
    ALTER TABLE funcionarios ADD COLUMN Salario float;
    ALTER TABLE funcionarios ADD COLUMN Aluguel float;
    '''
)

con.commit()

In [34]:
#Depois, vou verificar se as colunas foram criadas

query = 'SELECT * FROM funcionarios'

df = pd.read_sql_query(query, con)
df

  PrimeiroNome UltimoNome  USERID  Salario  Aluguel
0      Matheus     Brasil    1997   1000.0    650.0
1      Vitória      Lopes    1998    500.0      NaN
2      Eduardo      Silva    2001    200.0      NaN

In [37]:
#Por fim, vou inserir os valores de salário e aluguel para cada um dos funcionários

con.executescript(
    '''
    UPDATE funcionarios SET Salario = 1000 WHERE USERID = 1997;
    UPDATE funcionarios SET Salario = 2000 WHERE USERID = 1998;
    UPDATE funcionarios SET Salario = 800 WHERE USERID = 2001;
    '''
)

con.commit()

con.executescript(
    '''
    UPDATE funcionarios SET Aluguel = 650 WHERE USERID = 1997;
    UPDATE funcionarios SET Aluguel = 500 WHERE USERID = 1998;
    UPDATE funcionarios SET Aluguel = 200 WHERE USERID = 2001;
    '''
)

con.commit()

Agora, posso fazer os calculos

In [38]:
query = 'SELECT PrimeiroNome, Salario-Aluguel as RendaLiq FROM funcionarios'

df = pd.read_sql_query(query, con)
df

  PrimeiroNome  RendaLiq
0      Matheus     350.0
1      Vitória    1500.0
2      Eduardo     600.0